lambda/src/test/resources/Migrations/Newspaper2024/NewspaperVoucherBook-Annual/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NUMBER",
  "subscriptionNumber" : "ACCOUNT-NUMBER",
  "version" : 10,
  "revision" : "10.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2009-02-11",
  "serviceActivationDate" : "2009-02-11",
  "customerAcceptanceDate" : "2016-12-03",
  "subscriptionStartDate" : "2016-08-14",
  "subscriptionEndDate" : "2024-02-03",
  "lastBookingDate" : "2023-02-03",
  "termStartDate" : "2023-02-03",
  "termEndDate" : "2024-02-03",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 31.99,
  "totalContractedValue" : 2917.04,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : "2016-12-18T02:27:38.154Z",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "BG01",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a128f76860bed21018615f5f4b34a35",
    "lastChangeType" : "Remove",
    "productId" : "2c92a0fc55a0dc530155dfa5b8dd56c0",
    "productName" : "Newspaper Voucher",
    "productSku" : "ABC-00000014",
    "productRatePlanId" : "2c92a0fd56fe26b60157040cdd323f76",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Weekend+",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128f76860bed21018615f5f4b64a3b",
      "originalChargeId" : "2c92a0ff58bdf4ee0158ff72b16210b5",
      "productRatePlanChargeId" : "2c92a0ff56fe33f5015709b8fc4d5617",
      "number" : "C-00544720",
      "name" : "Sunday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-02-03",
      "effectiveEndDate" : "2021-02-03",
      "processedThroughDate" : "2021-02-03",
      "chargedThroughDate" : "2021-02-03",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.554166667,
      "dmrc" : 0.000000000,
      "tcv" : 633.250000000,
      "dtcv" : 126.650000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2020-02-03",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP126.65",
      "price" : 126.650000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128f76860bed21018615f5f4b64a39",
      "originalChargeId" : "2c92a0ff58bdf4ee0158ff72b15d10b4",
      "productRatePlanChargeId" : "2c92a0fe56fe33ff015709bb986636d8",
      "number" : "C-00544716",
      "name" : "Digipack",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "UseLatestProductCatalogPricing",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-02-03",
      "effectiveEndDate" : "2021-02-03",
      "processedThroughDate" : "2021-02-03",
      "chargedThroughDate" : "2021-02-03",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 8.666666667,
      "dmrc" : 0.000000000,
      "tcv" : 520.000000000,
      "dtcv" : 104.000000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2020-02-03",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP104",
      "price" : 104.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128f76860bed21018615f5f4b64a37",
      "originalChargeId" : "2c92a0ff58bdf4ee0158ff72b15910b3",
      "productRatePlanChargeId" : "2c92a0fd56fe26b601570432f4e33d17",
      "number" : "C-00544712",
      "name" : "Saturday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-02-03",
      "effectiveEndDate" : "2021-02-03",
      "processedThroughDate" : "2021-02-03",
      "chargedThroughDate" : "2021-02-03",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.202500000,
      "dmrc" : 0.000000000,
      "tcv" : 612.150000000,
      "dtcv" : 122.430000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2020-02-03",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP122.43",
      "price" : 122.430000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  }, {
    "id" : "8a128f76860bed21018615f5f4ba4a40",
    "lastChangeType" : "Add",
    "productId" : "2c92a0fc55a0dc530155dfa5b8dd56c0",
    "productName" : "Newspaper Voucher",
    "productSku" : "ABC-00000014",
    "productRatePlanId" : "2c92a0fd56fe26b60157040cdd323f76",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Weekend+",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128f76860bed21018615f5f4bc4a46",
      "originalChargeId" : "2c92a00f7693b22d0176a82969d757b2",
      "productRatePlanChargeId" : "2c92a0ff56fe33f5015709b8fc4d5617",
      "number" : "C-02808103",
      "name" : "Sunday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 4,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2021-02-03",
      "effectiveEndDate" : "2024-02-03",
      "processedThroughDate" : "2023-02-03",
      "chargedThroughDate" : "2024-02-03",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.990000000,
      "dmrc" : 0.000000000,
      "tcv" : 395.640000000,
      "dtcv" : 131.880000000,
      "originalOrderDate" : "2020-12-28",
      "amendedByOrderOn" : "2023-02-03",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP131.88",
      "price" : 131.880000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128f76860bed21018615f5f4bc4a44",
      "originalChargeId" : "2c92a00f7693b22d0176a82969d757b1",
      "productRatePlanChargeId" : "2c92a0fe56fe33ff015709bb986636d8",
      "number" : "C-02808102",
      "name" : "Digipack",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 4,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2021-02-03",
      "effectiveEndDate" : "2024-02-03",
      "processedThroughDate" : "2023-02-03",
      "chargedThroughDate" : "2024-02-03",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 360.000000000,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2020-12-28",
      "amendedByOrderOn" : "2023-02-03",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP120",
      "price" : 120.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128f76860bed21018615f5f4bc4a42",
      "originalChargeId" : "2c92a00f7693b22d0176a82969d657b0",
      "productRatePlanChargeId" : "2c92a0fd56fe26b601570432f4e33d17",
      "number" : "C-02808101",
      "name" : "Saturday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 4,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Annual",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2021-02-03",
      "effectiveEndDate" : "2024-02-03",
      "processedThroughDate" : "2023-02-03",
      "chargedThroughDate" : "2024-02-03",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 11.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 396.000000000,
      "dtcv" : 132.000000000,
      "originalOrderDate" : "2020-12-28",
      "amendedByOrderOn" : "2023-02-03",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP132",
      "price" : 132.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-00185015",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2016-08-14",
    "endDate" : "2024-02-03",
    "status" : "Active"
  }, {
    "startDate" : "2024-02-03",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}