lambda/src/test/resources/Migrations/Newspaper2024/NewspaperVoucherBook-Quarterly/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NUMBER",
  "subscriptionNumber" : "ACCOUNT-NUMBER",
  "version" : 11,
  "revision" : "11.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2009-02-04",
  "serviceActivationDate" : "2009-02-04",
  "customerAcceptanceDate" : "2016-11-26",
  "subscriptionStartDate" : "2016-08-14",
  "subscriptionEndDate" : "2024-10-26",
  "lastBookingDate" : "2023-10-26",
  "termStartDate" : "2023-10-26",
  "termEndDate" : "2024-10-26",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 31.99,
  "totalContractedValue" : 2947.84,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : "2016-12-20T03:01:07.931Z",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "BG01",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a128e088b64d6f2018b6a75ba4358ed",
    "lastChangeType" : "Remove",
    "productId" : "2c92a0fc55a0dc530155dfa5b8dd56c0",
    "productName" : "Newspaper Voucher",
    "productSku" : "ABC-00000014",
    "productRatePlanId" : "2c92a0fd56fe26b60157040cdd323f76",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Weekend+",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128e088b64d6f2018b6a75ba4658f3",
      "originalChargeId" : "2c92a0fd58cf57000158ff721f4a27ca",
      "productRatePlanChargeId" : "2c92a0ff56fe33f5015709b8fc4d5617",
      "number" : "C-00533412",
      "name" : "Sunday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-10-26",
      "effectiveEndDate" : "2020-10-26",
      "processedThroughDate" : "2020-10-26",
      "chargedThroughDate" : "2020-10-26",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.553333333,
      "dmrc" : 0.000000000,
      "tcv" : 506.560000000,
      "dtcv" : 126.640000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2019-10-26",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP31.66",
      "price" : 31.660000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128e088b64d6f2018b6a75ba4658f1",
      "originalChargeId" : "2c92a0fd58cf57000158ff721f4727c9",
      "productRatePlanChargeId" : "2c92a0fe56fe33ff015709bb986636d8",
      "number" : "C-00533410",
      "name" : "Digipack",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "UseLatestProductCatalogPricing",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-10-26",
      "effectiveEndDate" : "2020-10-26",
      "processedThroughDate" : "2020-10-26",
      "chargedThroughDate" : "2020-10-26",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 8.666666667,
      "dmrc" : 0.000000000,
      "tcv" : 416.000000000,
      "dtcv" : 104.000000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2019-10-26",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP26",
      "price" : 26.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128e088b64d6f2018b6a75ba4658ef",
      "originalChargeId" : "2c92a0fd58cf57000158ff721f4527c8",
      "productRatePlanChargeId" : "2c92a0fd56fe26b601570432f4e33d17",
      "number" : "C-00533407",
      "name" : "Saturday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-10-26",
      "effectiveEndDate" : "2020-10-26",
      "processedThroughDate" : "2020-10-26",
      "chargedThroughDate" : "2020-10-26",
      "done" : true,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.203333333,
      "dmrc" : 0.000000000,
      "tcv" : 489.760000000,
      "dtcv" : 122.440000000,
      "originalOrderDate" : "2016-12-14",
      "amendedByOrderOn" : "2019-10-26",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP30.61",
      "price" : 30.610000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  }, {
    "id" : "8a128e088b64d6f2018b6a75ba4958f8",
    "lastChangeType" : "Add",
    "productId" : "2c92a0fc55a0dc530155dfa5b8dd56c0",
    "productName" : "Newspaper Voucher",
    "productSku" : "ABC-00000014",
    "productRatePlanId" : "2c92a0fd56fe26b60157040cdd323f76",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Weekend+",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a128e088b64d6f2018b6a75ba4b58fe",
      "originalChargeId" : "2c92a00c74a2c97c0174a534fe3739d0",
      "productRatePlanChargeId" : "2c92a0ff56fe33f5015709b8fc4d5617",
      "number" : "C-02640789",
      "name" : "Sunday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-10-26",
      "effectiveEndDate" : "2024-10-26",
      "processedThroughDate" : "2023-10-26",
      "chargedThroughDate" : "2024-01-26",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.990000000,
      "dmrc" : 0.000000000,
      "tcv" : 527.520000000,
      "dtcv" : 131.880000000,
      "originalOrderDate" : "2020-09-19",
      "amendedByOrderOn" : "2023-10-26",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP32.97",
      "price" : 32.970000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128e088b64d6f2018b6a75ba4b58fc",
      "originalChargeId" : "2c92a00c74a2c97c0174a534fe3739cf",
      "productRatePlanChargeId" : "2c92a0fe56fe33ff015709bb986636d8",
      "number" : "C-02640788",
      "name" : "Digipack",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-10-26",
      "effectiveEndDate" : "2024-10-26",
      "processedThroughDate" : "2023-10-26",
      "chargedThroughDate" : "2024-01-26",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 480.000000000,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2020-09-19",
      "amendedByOrderOn" : "2023-10-26",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP30",
      "price" : 30.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a128e088b64d6f2018b6a75ba4b58fa",
      "originalChargeId" : "2c92a00c74a2c97c0174a534fe3739ce",
      "productRatePlanChargeId" : "2c92a0fd56fe26b601570432f4e33d17",
      "number" : "C-02640787",
      "name" : "Saturday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Quarter",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-10-26",
      "effectiveEndDate" : "2024-10-26",
      "processedThroughDate" : "2023-10-26",
      "chargedThroughDate" : "2024-01-26",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 11.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 528.000000000,
      "dtcv" : 132.000000000,
      "originalOrderDate" : "2020-09-19",
      "amendedByOrderOn" : "2023-10-26",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP33",
      "price" : 33.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-01542595",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2016-08-14",
    "endDate" : "2024-10-26",
    "status" : "Active"
  }, {
    "startDate" : "2024-10-26",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}