lambda/src/test/resources/Newspaper2024/NewspaperVoucherBook-Monthly/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-ID",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NAME",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NAME",
  "subscriptionNumber" : "SUBSCRIPTION-NUMBER",
  "version" : 6,
  "revision" : "6.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2020-07-19",
  "serviceActivationDate" : "2020-07-19",
  "customerAcceptanceDate" : "2020-08-15",
  "subscriptionStartDate" : "2020-07-19",
  "subscriptionEndDate" : "2025-07-19",
  "lastBookingDate" : "2023-04-16",
  "termStartDate" : "2024-07-19",
  "termEndDate" : "2025-07-19",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 31.99,
  "totalContractedValue" : 1891.54,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : "GXX83X",
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : "Direct",
  "ActivationDate__c" : null,
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : "GB",
  "PromotionCode__c" : "GXX83X",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a1288dd877e3a9a018789c70793051f",
    "lastChangeType" : "Add",
    "productId" : "2c92a0ff5345f9200153559c6d2a3385",
    "productName" : "Discounts",
    "productSku" : "ABC-00000012",
    "productRatePlanId" : "2c92a00864176ce90164232ac0d90fc1",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Cancellation Save Discount - 50% off for 3 months",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a1288dd877e3a9a018789c707930520",
      "originalChargeId" : "8a1288dd877e3a9a018789c707930520",
      "productRatePlanChargeId" : "2c92a0ff64176cd50164232c7e493410",
      "number" : "C-04265777",
      "name" : "50% discount on subscription for 3 months",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "DiscountPercentage",
      "uom" : null,
      "version" : 1,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : "ONETIMERECURRINGUSAGE",
      "discountLevel" : "subscription",
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : null,
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : null,
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : null,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2023-05-15",
      "effectiveEndDate" : "2023-08-15",
      "processedThroughDate" : "2023-07-15",
      "chargedThroughDate" : "2023-08-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Fixed_Period",
      "upToPeriodsType" : "Months",
      "upToPeriods" : 3,
      "specificEndDate" : null,
      "mrr" : 0.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 0.000000000,
      "dtcv" : 0.000000000,
      "originalOrderDate" : "2023-04-16",
      "amendedByOrderOn" : null,
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "50%  discount",
      "price" : null,
      "discountAmount" : null,
      "discountPercentage" : 50.000000000
    } ]
  }, {
    "id" : "8a1288dd877e3a9a018789c707da0528",
    "productId" : "2c92a0fc55a0dc530155dfa5b8dd56c0",
    "productName" : "Newspaper Voucher",
    "productSku" : "ABC-00000014",
    "productRatePlanId" : "2c92a0fd56fe26b60157040cdd323f76",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Weekend+",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a1288dd877e3a9a018789c707dc052e",
      "originalChargeId" : "2c92a00d7351598401736785a72043a6",
      "productRatePlanChargeId" : "2c92a0ff56fe33f5015709b8fc4d5617",
      "number" : "C-02302023",
      "name" : "Sunday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-08-15",
      "effectiveEndDate" : "2025-07-19",
      "processedThroughDate" : "2023-12-15",
      "chargedThroughDate" : "2024-01-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.990000000,
      "dmrc" : 0.000000000,
      "tcv" : 649.828064515,
      "dtcv" : 131.880000000,
      "originalOrderDate" : "2020-07-19",
      "amendedByOrderOn" : "2023-04-16",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP10.99",
      "price" : 10.990000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a1288dd877e3a9a018789c707dc052c",
      "originalChargeId" : "2c92a00d7351598401736785a71e43a5",
      "productRatePlanChargeId" : "2c92a0fe56fe33ff015709bb986636d8",
      "number" : "C-02302022",
      "name" : "Digipack",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-08-15",
      "effectiveEndDate" : "2025-07-19",
      "processedThroughDate" : "2023-12-15",
      "chargedThroughDate" : "2024-01-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 10.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 591.290322580,
      "dtcv" : 120.000000000,
      "originalOrderDate" : "2020-07-19",
      "amendedByOrderOn" : "2023-04-16",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP10",
      "price" : 10.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    }, {
      "id" : "8a1288dd877e3a9a018789c707dc052a",
      "originalChargeId" : "2c92a00d7351598401736785a71b43a4",
      "productRatePlanChargeId" : "2c92a0fd56fe26b601570432f4e33d17",
      "number" : "C-02302021",
      "name" : "Saturday",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 5,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "prorationOption" : null,
      "isStackedDiscount" : false,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2020-08-15",
      "effectiveEndDate" : "2025-07-19",
      "processedThroughDate" : "2023-12-15",
      "chargedThroughDate" : "2024-01-15",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 11.000000000,
      "dmrc" : 0.000000000,
      "tcv" : 650.419354838,
      "dtcv" : 132.000000000,
      "originalOrderDate" : "2020-07-19",
      "amendedByOrderOn" : "2023-04-16",
      "description" : "",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP11",
      "price" : 11.000000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-00472330",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2020-07-19",
    "endDate" : "2025-07-19",
    "status" : "Active"
  }, {
    "startDate" : "2025-07-19",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}